cmsis-svd/cmsis-svd/data/Atmel/ATSAM3U2C.svd
        <register>
          <name>IER2</name>
          <description>Interrupt Enable Register (channel = 2)</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR2</name>
          <description>Interrupt Disable Register (channel = 2)</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR2</name>
          <description>Interrupt Mask Register (channel = 2)</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COVFS</name>
              <description>Counter Overflow</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOVRS</name>
              <description>Load Overrun</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPAS</name>
              <description>RA Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPBS</name>
              <description>RB Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPCS</name>
              <description>RC Compare</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDRAS</name>
              <description>RA Loading</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDRBS</name>
              <description>RB Loading</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ETRGS</name>
              <description>External Trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR</name>
          <description>Block Control Register</description>
          <addressOffset>0x000000C0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYNC</name>
              <description>Synchro Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BMR</name>
          <description>Block Mode Register</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TC0XC0S</name>
              <description>External Clock Signal 0 Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK0</name>
                  <description>Signal connected to XC0: TCLK0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Signal connected to XC0: TIOA1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Signal connected to XC0: TIOA2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC1XC1S</name>
              <description>External Clock Signal 1 Selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK1</name>
                  <description>Signal connected to XC1: TCLK1</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Signal connected to XC1: TIOA0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA2</name>
                  <description>Signal connected to XC1: TIOA2</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TC2XC2S</name>
              <description>External Clock Signal 2 Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TCLK2</name>
                  <description>Signal connected to XC2: TCLK2</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA0</name>
                  <description>Signal connected to XC2: TIOA0</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIOA1</name>
                  <description>Signal connected to XC2: TIOA1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QDEN</name>
              <description>Quadrature Decoder Enabled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POSEN</name>
              <description>Position Enabled</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPEEDEN</name>
              <description>Speed Enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QDTRANS</name>
              <description>Quadrature Decoding Transparent</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGPHA</name>
              <description>Edge on PHA Count Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVA</name>
              <description>Inverted PHA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVB</name>
              <description>Inverted PHB</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INVIDX</name>
              <description>Inverted Index</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWAP</name>
              <description>Swap PHA and PHB</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDXPHB</name>
              <description>Index Pin is PHB Pin</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXFILT</name>
              <description>Maximum Filter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QIER</name>
          <description>QDEC Interrupt Enable Register</description>
          <addressOffset>0x000000C8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QIDR</name>
          <description>QDEC Interrupt Disable Register</description>
          <addressOffset>0x000000CC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QIMR</name>
          <description>QDEC Interrupt Mask Register</description>
          <addressOffset>0x000000D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QISR</name>
          <description>QDEC Interrupt Status Register</description>
          <addressOffset>0x000000D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IDX</name>
              <description>Index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRCHG</name>
              <description>Direction Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QERR</name>
              <description>Quadrature Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIR</name>
              <description>Direction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
