cmsis-svd/cmsis-svd/data/Atmel/ATSAM3U2C.svd
        <register>
          <name>ECC_SR1</name>
          <description>SMC ECC Status 1 Register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RECERR0</name>
              <description>Recoverable Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR0</name>
              <description>ECC Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR1</name>
              <description>Recoverable Error in the page between the 256th and the 511th bytes or the 512nd and the 1023rd bytes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR1</name>
              <description>ECC Error in the page between the 256th and the 511th bytes or between the 512nd and the 1023rd bytes</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR1</name>
              <description>Multiple Error in the page between the 256th and the 511th bytes or between the 512nd and the 1023rd bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR2</name>
              <description>Recoverable Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR2</name>
              <description>ECC Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR2</name>
              <description>Multiple Error in the page between the 512nd and the 767th bytes or between the 1024th and the 1535th bytes</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR3</name>
              <description>Recoverable Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR3</name>
              <description>ECC Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR3</name>
              <description>Multiple Error in the page between the 768th and the 1023rd bytes or between the 1536th and the 2047th bytes</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR4</name>
              <description>Recoverable Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR4</name>
              <description>ECC Error in the page between the 1024th and the 1279th bytes or between the 2048th and the 2559th bytes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR5</name>
              <description>Recoverable Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR5</name>
              <description>ECC Error in the page between the 1280th and the 1535th bytes or between the 2560th and the 3071st bytes</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR6</name>
              <description>Recoverable Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR6</name>
              <description>ECC Error in the page between the 1536th and the 1791st bytes or between the 3072nd and the 3583rd bytes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR7</name>
              <description>Recoverable Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR7</name>
              <description>ECC Error in the page between the 1792nd and the 2047th bytes or between the 3584th and the 4095th bytes</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR0</name>
          <description>SMC ECC Parity 0 Register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Bit Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Word Address</description>
              <bitOffset>4</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR0_W9BIT</name>
          <description>SMC ECC Parity 0 Register</description>
          <alternateGroup>W9BIT</alternateGroup>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR0_W8BIT</name>
          <description>SMC ECC Parity 0 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR1</name>
          <description>SMC ECC parity 1 Register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR1_W9BIT</name>
          <description>SMC ECC parity 1 Register</description>
          <alternateGroup>W9BIT</alternateGroup>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR1_W8BIT</name>
          <description>SMC ECC parity 1 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_SR2</name>
          <description>SMC ECC status 2 Register</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RECERR8</name>
              <description>Recoverable Error in the page between the 2048th and the 2303rd bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR8</name>
              <description>ECC Error in the page between the 2048th and the 2303rd bytes</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR9</name>
              <description>Recoverable Error in the page between the 2304th and the 2559th bytes</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR9</name>
              <description>ECC Error in the page between the 2304th and the 2559th bytes</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR9</name>
              <description>Multiple Error in the page between the 2304th and the 2559th bytes</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR10</name>
              <description>Recoverable Error in the page between the 2560th and the 2815th bytes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR10</name>
              <description>ECC Error in the page between the 2560th and the 2815th bytes</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR10</name>
              <description>Multiple Error in the page between the 2560th and the 2815th bytes</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR11</name>
              <description>Recoverable Error in the page between the 2816th and the 3071st bytes</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR11</name>
              <description>ECC Error in the page between the 2816th and the 3071st bytes</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULERR11</name>
              <description>Multiple Error in the page between the 2816th and the 3071st bytes</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR12</name>
              <description>Recoverable Error in the page between the 3072nd and the 3327th bytes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR12</name>
              <description>ECC Error in the page between the 3072nd and the 3327th bytes</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR13</name>
              <description>Recoverable Error in the page between the 3328th and the 3583rd bytes</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR13</name>
              <description>ECC Error in the page between the 3328th and the 3583rd bytes</description>
              <bitOffset>21</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR14</name>
              <description>Recoverable Error in the page between the 3584th and the 3839th bytes</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR14</name>
              <description>ECC Error in the page between the 3584th and the 3839th bytes</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RECERR15</name>
              <description>Recoverable Error in the page between the 3840th and the 4095th bytes</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCERR15</name>
              <description>ECC Error in the page between the 3840th and the 4095th bytes</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR2</name>
          <description>SMC ECC parity 2 Register</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR2_W8BIT</name>
          <description>SMC ECC parity 2 Register</description>
          <alternateGroup>W8BIT</alternateGroup>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_PR3</name>
          <description>SMC ECC parity 3 Register</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BITADDR</name>
              <description>Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WORDADDR</name>
              <description>Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes</description>
              <bitOffset>3</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPARITY</name>
              <description>Parity N</description>
              <bitOffset>12</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
